-- 카테고리 삽입
INSERT INTO category (name) VALUES
    ('Phon'),  -- 음운
    ('Alter'), -- 음운의 변동
    ('Add');   -- 사잇소리 현상

-- 서브카테고리 삽입
INSERT INTO subcategory (name, category_id) VALUES
    -- 음운 (category_id = 1)
    ('I', 1),  ('EU', 1), ('U', 1),  ('E', 1),  ('EO', 1),  -- ㅣ, ㅡ, ㅜ, ㅔ, ㅓ
    ('O', 1),  ('AE', 1), ('A', 1),                         -- ㅗ, ㅐ, ㅏ

    ('G', 1),  ('N', 1),  ('D', 1),  ('R', 1),  ('M', 1),   -- ㄱ, ㄴ, ㄷ, ㄹ, ㅁ
    ('B', 1),  ('S', 1),  ('O', 1),  ('J', 1),  ('CH', 1),  -- ㅂ, ㅅ, ㅇ, ㅈ, ㅊ
    ('K', 1),  ('T', 1),  ('P', 1),  ('H', 1),              -- ㅋ, ㅌ, ㅍ, ㅎ

    ('FinalSound', 1),  -- 음절의 끝소리
    ('Voiced', 1), -- 유성자음
    ('Unvoiced', 1), -- 무성자음

    -- 음운의 변동 (category_id = 2)
    ('VowelHarmony', 2),  -- 모음조화
    ('ContractionAndElision', 2),  -- 축약과 탈락
    ('ConsonantAssimilation', 2),  -- 자음동화
    ('GlottalizationAndSonorization', 2),  -- 경음화와 유성음화
    ('Glottalization', 2),  -- 격음화
    ('Palatalization', 2),  -- 구개음화

    -- 사잇소리 현상 (category_id = 3)
    ('SInsertion', 3),  -- ㅅ 첨가
    ('NInsertion', 3);  -- ㄴ 첨가


-- 단어 삽입
INSERT INTO word (text, word_pron, subcategory_id) VALUES
    ('입질', '입찔', 1), ('인기', '인끼', 1), ('직인', '지긴', 1), ('깊이', '기피', 1), ('짚신', '집씬', 1), ('일시', '일씨', 1), ('실직', '실찍', 1), -- ㅣ
    ('특근', '특끈', 2), ('습득', '습뜩', 2), ('그릇', '그륻', 2), ('급증', '급쯩', 2), ('측근', '측끈', 2), ('느긋', '느귿', 2), ('즉흥', '즈킁', 2), -- ㅡ
    ('숙주', '숙쭈', 3), ('축구', '축꾸', 3), ('불순', '불쑨', 3), ('문물', '문물', 3), ('출두', '출뚜', 3), ('국수', '국쑤', 3), ('국물', '궁물', 3), -- ㅜ
    ('벨벳', '벨벧', 4), ('엑셀', '엑셀', 4), ('헬멧', '헬멛', 4), ('세제', '세제', 4), -- ㅔ
    ('절전', '절쩐', 5), ('전어', '저너', 5), ('법전', '법쩐', 5), ('뻣뻣', '뻗뻗', 5), ('절정', '절쩡', 5), ('헝겊', '헝겁', 5), ('전형', '저녕', 5), -- ㅓ
    ('본론', '볼론', 6), ('목동', '목똥', 6), ('독종', '독쫑', 6), ('목공', '목꽁', 6), ('옥돌', '옥똘', 6), ('종로', '종노', 6), ('속보', '속뽀', 6), -- ㅗ
    ('색맹', '생맹', 7), ('생색', '생색', 7), ('객색', '객쌕', 7), ('재생', '재생', 7), ('행색', '행색', 7), -- ㅐ
    ('박학', '바칵', 8), ('답사', '답싸', 8), ('갉다', '각따', 8), ('팔자', '팔짜', 8), ('낱말', '난말', 8), ('바다', '바다', 8), ('닭살', '닥쌀', 8); -- ㅏ

INSERT INTO word (text, word_pron, subcategory_id) VALUES
    ('강릉', '강능', 9), ('공권력', '공꿘녁', 9), ('긍락', '긍낙', 9), ('경로당', '경노당', 9), ('공략', '공냑', 9), ('궁리', '궁니', 9), ('감염', '가몀', 9), -- ㄱ
    ('난로', '날로', 10), ('내리막길', '내리막낄', 10), ('내복약', '내봉냑', 10), ('논란', '놀란', 10), ('논리', '놀리', 10), ('나뭇잎', '나문닙', 10), ('낱개', '낟깨', 10), -- ㄴ
    ('다락방', '다락빵', 11), ('단련', '달련', 11), ('닭다리', '닥따리', 11), ('닭살', '닥쌀', 11), ('담력', '담녁', 11), ('답장', '답짱', 11), ('당락', '당낙', 11), -- ㄷ
    ('락스', '락쓰', 12), ('라면', '라면', 12), ('라디오', '라디오', 12), ('라일락', '라일락', 12), -- ㄹ
    ('맏형', '마텽', 13), ('맑다', '막따', 13), ('맞춤법', '맏춤뻡', 13), ('머리맡', '머리맡', 13), ('맨날', '맨날', 13), ('많은', '마는', 13), ('맏며느리', '만며느리', 13), -- ㅁ
    ('바깥', '바깓', 14), ('밝다', '박따', 14), ('밥맛', '밤맏', 14), ('밥솥', '밥쏟', 14), ('벚꽃', '벋꽃', 14), ('복습', '복씁', 14), ('불법', '불뻡', 14), -- ㅂ
    ('샅샅이', '삳싸치', 15), ('색맹', '생맹', 15), ('생략', '생냑', 15), ('선릉', '설능', 15), ('성례', '성녜', 15), ('습득', '습뜩', 15), ('섞이다', '서끼다', 15), -- ㅅ
    ('앉다', '안따', 16), ('알록달록', '알록딸록', 16), ('앞마당', '암마당', 16), ('애국심', '애국씸', 16), ('약속', '약쏙', 16), ('양력', '양녁', 16), ('열쇠', '열쐬', 16), -- ㅇ
    ('잡지', '잡찌', 17), ('장미꽃', '장미꼳', 17), ('적발', '작빨', 17), ('적응', '저긍', 17), ('전류', '절류', 17), ('접속', '접쏙', 17), ('작문', '장문', 17), -- ㅈ
    ('착각', '착깍', 18), ('참숯', '참숟', 18), ('찻잔', '찯짠', 18), ('축하', '추카', 18), ('출입문', '출임문', 18), ('착용', '차굥', 18), ('창살', '창쌀', 18), -- ㅊ
    ('칼국수', '칼국쑤', 19), ('칸막이', '칸마기', 19), ('칼날', '칼랄', 19), ('칼자국', '칼짜국', 19), ('콜라', '콜나', 19), ('크레파스', '크레파쓰', 19), ('크리스마스', '크리쓰마쓰', 19), -- ㅋ
    ('탈선', '탈썬', 20), ('탑승', '탑씅', 20), ('태권도', '태꿘도', 20), ('태평양', '태평냥', 20), ('택배', '택빼', 20), ('통로', '통노', 20), ('탈옥', '타록', 20), -- ㅌ
    ('팔십', '팔씹', 21), ('팔자', '팔짜', 21), ('편리', '펼리', 21), ('편입', '펴닙', 21), ('평론', '평논', 21), ('폭발', '폭빨', 21), ('풍력', '풍녁', 21), -- ㅍ
    ('학생', '학쌩', 22), ('학습', '학씁', 22), ('학자', '학짜', 22), ('한글날', '한글랄', 22), ('현란', '혈란', 22), ('해돋이', '해도지', 22), ('혁명', '형명', 22); -- ㅎ

INSERT INTO word (text, word_pron, subcategory_id) VALUES
    ('해맞이', '해마지', 23), ('학교', '학꾜', 23), ('할인', '하린', 23), ('낮', '낟', 23), ('낯', '낟', 23),
    ('낫', '낟', 23), ('부엌', '부억', 23), ('해돋이', '해도지', 23), ('팔월', '파뤌', 23), -- 음절의 끝소리

    ('나무', '나무', 24), ('닭', '닥', 24), ('물', '물', 24), ('안경', '안경', 24), ('끊다', '끈타', 24),
    ('찌개', '찌개', 24), ('자리', '자리', 24), -- 유성자음

    ('토마토', '토마토', 25), ('캐나다', '캐나다', 25), ('사과', '사과', 25), ('헬기', '헬기', 25),
    ('치킨', '치킨', 25), ('수박', '수박', 25), ('고기', '고기', 25), -- 무성자음

    ('도토리', '도토리', 26), ('거북이', '거부기', 26), ('바람', '바람', 26), ('바가지', '바가지', 26), ('가랑비', '가랑비', 26),
    ('버드나무', '버드나무', 26), ('벌레', '벌레', 26), -- 모음조화

    ('좋아', '조아', 27), ('많고', '만코', 27), ('낳은', '나은', 27), ('살아', '사라', 27), ('열어', '여러', 27),
    ('울어', '우러', 27), -- 축약과 탈락

    ('입맛', '임맏', 28), ('음력', '음녘', 28), ('종로', '종노', 28), ('백만', '뱅만', 28), ('백년', '뱅년', 28),
    ('십리', '심니', 28), ('판단력', '판단녁', 28), ('일년', '일련', 28), -- 자음동화

    ('밥상', '밥쌍', 29), ('맏사위', '맏싸위', 29), ('백반', '백빤', 29), ('식당', '식땅', 29), ('염증', '염쯩', 29),
    ('점수', '점쑤', 29), ('곰국', '곰꾹', 29), -- 경음화와 유성음화

    ('꽃향기', '꼬턍기', 30), ('싫지', '실치', 30), ('북한', '부칸', 30), ('각하', '가카', 30), ('좋디', '조티', 30),
    ('자그맣다', '자그마타', 30), ('닳지', '달치', 30), -- 격음화

    ('여닫이', '여다지', 31), ('맏이', '마지', 31), ('같이', '가치', 31), ('굳이', '구지', 31), ('곧이', '고지', 31),
    ('낱낱이', '난나치', 31), ('햇볕이', '핻뼈치, 해뼈치', 31), -- 구개음화

    ('부엌일', '부엉 닐', 32), ('어떤일', '어떤 닐', 32), ('맨입', '맨닙', 32), ('한일', '한닐', 32), ('낮일', '난 닐', 32),
    ('잔일', '잔닐', 32), ('속잎', '송님', 32), -- ㅅ 첨가

    ('촛불', '촏뿔, 초뿔', 33), ('콧등', '콛등, 코뜽', 33), ('뱃사공', '밷싸공, 배싸공', 33), ('햇빛', '핻삗, 해삗', 33), ('냇가', '낻까, 내까', 33),
    ('샛길', '샏낄, 새낄', 33), ('뱃속', '밷쏙, 배쏙', 33); -- ㄴ 첨가