const wordsData = {
  ㄱ: ["가방", "강아지", "고양이", "기린", "김치", "감자", "거북이"],
  ㄴ: ["나무", "노트", "눈사람", "날씨", "냉장고", "네모", "누룽지"],
  ㄷ: ["다리", "도서관", "독수리", "달력", "두부", "당근", "드럼"],
  ㄹ: ["라디오", "로봇", "리본", "람보", "래미콘", "러시아", "레몬"],
  ㅁ: ["마이크", "모니터", "망원경", "모자", "마늘", "밀가루", "메론"],
  ㅂ: ["바나나", "볼펜", "비행기", "버스", "보석", "밥솥", "빵"],
  ㅅ: ["사과", "선풍기", "소라", "신발", "사자", "새우", "수박"],
  ㅇ: ["오리", "우산", "의자", "올리브", "오토바이", "옥수수", "오징어"],
  ㅈ: ["자전거", "조각", "주전자", "지구본", "전화기", "지갑", "저울"],
  ㅊ: ["참외", "천사", "초콜릿", "축구공", "칠판", "창문", "차"],
  ㅋ: ["카메라", "코끼리", "코트", "캠핑", "커피", "칼", "칵테일"],
  ㅌ: ["토마토", "태양", "타이어", "트럭", "탱크", "터미널", "토끼"],
  ㅍ: ["피아노", "포도", "팔찌", "팬더", "파이프", "풍선", "플라워"],
  ㅎ: ["하늘", "헬멧", "호랑이", "할머니", "호텔", "햄버거", "형광펜"],
};

export default wordsData;
